//shell.js
const exec = require('child_process').exec;
var yourscript = exec('tesseract /home/sasurean/node/win/resource/img/upload/og3mnme0zVJC90NCOe1-o.png stdout -l tha+eng',
        (error, stdout, stderr) => {
            console.log(`${stdout}`);
            console.log(`${stderr}`);
            if (error !== null) {
                console.log(`exec error: ${error}`);
            }
        });

/*
1411643582-S1941671-o.jpg
5113_image_th_170926074557.png
og3mnme0zVJC90NCOe1-o.png
oobr2duzwfQFEKeOXLO-o.jpg
oqil0b3y92o313xi5mG-o.jpg
TMN_22102018_145706721.jpg
	/************************************/
	/*
โอนเงีนใหั จารุณิ สุดซดา

100.00 ฿
เบอปี๊หรศัพทั 064-046-8725
ฆ้อความ
Suﬁ-mm 22/10/2018 14:56
Lamﬁa‘mm 50001277860041

ซองทางการซําระเงิน อู้ญซืทรูมันน็ วอลเล็ท
จํานวนเงืน 100.00 บาท
ค่าธรรมณียม 0.00 บาท
ยอตเงืนรวม 100.00 บาท

เงืนคงเหลือ 113.47 บาท
*/
/************************************/
/*
tmn-1193100887.jpg
/*
true bill group

true 517.88 ฿

รหืสลูกดัา/ หมายเลซโทรดัพทย็

"W‘- 0835077746 517.88
วีนทิ่-เวลา 03 กุมภาพํนธั2562 07:46
หมายเลขการทํารายการ 190203074615159KJNJ2
หมายเลขอ๋างอิง 50001736581535
ซองทางการซ่าระเงิน ทรูมันนื่ วอลเลึท
ยอดซ่าระ 517.88
ค่าธรรมเน็ยม 0.00

ยอดรวมทั้งหมด 517.88฿
*/
/*
TXN_1189IV35221e6f_1539959724609.jpg
/*
- - u ดี
|ตบ|งแสา|8จ
19 ฟิด' 2561 — 21:35
รหัลอ้างอ็ง: 1189IV35221961‘

๑ บาย ป3:|ถีอิ๊จุ สุต6ตา

xxx—xxx657—9

." บืญฮีกธู บืบบื
0835077746

จําแอแ|งีแ

คํา888บ|บืยบ

ร่วบบุจิ๊าาคเพีอจ้ถชืออุปก5ณีกบกา$แพกยํ
เพีออาคาธแวบึบก5บพึ๓5 ๘๔ พ$5ษา
คฌ=เเพกยศาสถธิ์กิงี้51ฮพยาบาล บทาวิกยาล้ยบทิถล
*/ /*
TXN_11854J3643e051.jpg
/*
@ my Us:la§5_7 £1me

xxx—xxx657—9

0 MRS. JARUNEE

SU DC HADA
0178386212

équouﬁu 2,000.00

Fi'ISSSIJIUUU 0.00

*//*
TXN_201811248DyIlJsDZhzTngNrH_1543040116378.jpg
โอบ|งีแสํา|ฐิจ

24 พ'ย' 2561 - 13:15
รหัลอ้างอิง: 201811248Dy||JsDZhZTngNrH

จาก ๑ บาย ป8:|อือิ๊จุ สุตอืตา

xxx—xxx657—9

luau ๑ บาง ๐าธุณี ยอต8าอื

xxx—XXX772—3

6’1uouﬁu 1,000.00

n'wsssmtiuu 0.00

*/
/* TCK0000000017.png */
/*
ตั่วโดยสารรถตู้
ขี่อญัห้บรึการ : บรึษีทจูนแอนต๋\จมสื้ ทรานสปอรุ้ด
ขี่อ\สิ้นทาหึ : mam หึ หัวหิน
เทียววุ้นที : 03/02/2019
เทียว\วลา : 15:00 น.
จุดขี้นรถ : สถาบี BTS บางทว้า
จุดลงรถ : หึ
ขี่อผู้จฌ : เงือน
เบอปี๊ทร : 0835077746

WWW

ทมาย\ลขทีบัหึ ราคา
WWW—“WW

6 180.00 บาท
7 180.00 บาท
ค่าปิ๊รรม\บียมบรึการ 24.00 บาท

WWW

รวม 384.00 บาท

WWW
ข้อแนะบัาในการบาขึ้นรถ

1. ดึ๋วใม่สามารถคืนใต้ แต่คุฌสามารถ\ลึ่อน\วลา

การ\ดินทาหึใต้ 1 ครั้ง และต้ฌแอ้ฒ่อน

รถออกจากคิว 1 ชม. โดยทํารายการ\ลึ่อน\ดินทาง

ฝานทาหึ vanbot ที\มนู `ขอ\ลึ่อนดึ๋ว`

2. ควรมาถีหึจุดขี้นรถก่อนรถมาถีหึอย่างป้อย 15

นาที

3. ทากคุฌมาขี้นรถใม่ทีน

ทลัหึจากรถใปถีหึจุดขี้นรถแล้ว 10 นาที

ทาทิวจะดิดต่อคุฌใปทาหึทมาย\ลขโทรศึพที

ทีแอ้หึใว้ดอนริ้อดึ๋ว

4. หากดิดต่อใปแล้วคุฌยั้งใม่สามารถมาขี้นรถ

ใต้ภายใน 10 นาที ระบบจะถีอวุ่าคุฌใม่มา

ขี้นรถตามก๋าทนด\วลา

และจะใม่สามารถคืนทรึฌลึ่อนดึ๋วใต้

5. จองดึ๋วง่ายๆ

ครั้หึต่อใป\ทียงสแกนคิวอาป็ค้ดต้านส่าง \พี่อ\พิ่ม

vanbot \ปี๋น\พิ่อนลงใน LINE ‘00an



ขอบคุฌฟื้ซ้บริการ
ฒาณฒตั่ว 0000000017
*/
/*
วิธีการสร้างไฟล์ traindata
http://nablatronics.blogspot.com/2014/05/traindata-ocr-tesseract.html
https://bact.cc/2018/tesseract-thai/
*/